EventsHub/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    # We're gonna use json to load events in the background
    if request.format.json?
      if params[:user_id]
        @events = Event.where(user_id: params[:user_id]).page(@page)
      else
        @events = Event.page(@page)